IDEA Open Model
BoltParam.Angles Property
Compatible with IDEA StatiCa v 10.1
 Gets or sets the groups and positions for angles.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public NumberGroups Angles { get; set; }
Public Property Angles As NumberGroups
	Get
	Set
public:
property NumberGroups^ Angles {
	NumberGroups^ get ();
	void set (NumberGroups^ value);
}
Property Value
Type: NumberGroups
See Also
Reference
BoltParam Class
IdeaRS.OpenModel.Parameters Namespace